service-mediator-automation/src/test/resources/testfiles/QA1/providerInitiatedMessage/Connecthub-Inbound-GeneralMessage_ProviderInitiated.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header/>
	<S:Body>
<AllscriptsMessageEnvelope xmlns="http://Allscripts.com/UAI/Schemas/2010/02/15" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<MessageDispatchHeader>
		<ID xmlns="">20101112-949PM-0906b2b2-e690-459f-82f0-82d6c33e6e03
		</ID>        20101112-949PM-0906b2b2-e690-459f-82f0-82d6c33e6e03
		<Noun xmlns="">ProviderMessage</Noun>
		<Verb xmlns="">Generated</Verb>
		<TimeStamp xmlns="">9:36:36 PM</TimeStamp>
		<Description xmlns="">Test Description</Description>
		<Originator xmlns=""/>
		<Destination xmlns=""/>
	</MessageDispatchHeader>
	<EntityContext>
		<KeyedValues>
			<KeyedValue>
				<Key>AccountID</Key>
				<Value>00000000000000099930</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>SiteID</Key>
				<Value>2222222</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>ProductID</Key>
				<Value>EEHR</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>ProductVersion</Key>
				<Value>11.2</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>OrgID</Key>
				<Value>5678</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>DestinationSiteID</Key>
				<Value>??20971??</Value>
			</KeyedValue>
		</KeyedValues>
	</EntityContext>
	<MessageContent xmlns="">
		<GeneralMessage SchemaName="GeneralMessage" xsi:schemaLocation="urn:Allscripts:Hub:PatientMsg PortalPHRMsg.xsd" xmlns="urn:Allscripts:Hub:PatientMsg" xmlns:mombt="urn:Allscripts:mombt">
			<PatientMsgBase Audience="text" ReceiptRequired="true">
				<mombt:MessageID>String</mombt:MessageID>
				<mombt:ReplyToMessageID></mombt:ReplyToMessageID>
				<mombt:Subject>??test web msg??</mombt:Subject>
				<mombt:Content>??Testing message flow??</mombt:Content>
				<mombt:Patient Audience="text">
					<mombt:Mrn>2013080601</mombt:Mrn>
					<mombt:IDs Audience="text">
						<mombt:CodeValue>???49317???</mombt:CodeValue>
						<mombt:CodeDescription>Patient</mombt:CodeDescription>
						<mombt:CodeType>Id</mombt:CodeType>
						<mombt:CodingSystem>Intuit</mombt:CodingSystem>
						<mombt:Extended>
							<mombt:AlternativeCodeValue>String</mombt:AlternativeCodeValue>
							<mombt:AlternativeCodeDescription>String</mombt:AlternativeCodeDescription>
							<mombt:AlternativeCodeType>String</mombt:AlternativeCodeType>
							<mombt:AlternativeCodingSystem>String</mombt:AlternativeCodingSystem>
							<mombt:AssigningAuthority>
								<mombt:NamespaceID>String</mombt:NamespaceID>
								<mombt:UniversalID>String</mombt:UniversalID>
								<mombt:UniversalIDType>String</mombt:UniversalIDType>
							</mombt:AssigningAuthority>
							<mombt:CheckDigit>
								<mombt:CheckDigitType>NPI</mombt:CheckDigitType>
								<mombt:CheckDigitValue>String</mombt:CheckDigitValue>
							</mombt:CheckDigit>
							<mombt:AssigningFacility>
								<mombt:NamespaceID>String</mombt:NamespaceID>
								<mombt:UniversalID>String</mombt:UniversalID>
								<mombt:UniversalIDType>String</mombt:UniversalIDType>
							</mombt:AssigningFacility>
						</mombt:Extended>
					</mombt:IDs>
					<mombt:Name Audience="text">
						<mombt:Title>String</mombt:Title>
						<mombt:First>String</mombt:First>
						<mombt:Middle>String</mombt:Middle>
						<mombt:Last>String</mombt:Last>
						<mombt:Suffix>String</mombt:Suffix>
						<mombt:NameType>Legal</mombt:NameType>
						<mombt:Degree>String</mombt:Degree>
					</mombt:Name>
					<mombt:Ssn>String</mombt:Ssn>
					<mombt:DateOfBirth>1967-08-13</mombt:DateOfBirth>
					<mombt:Gender>f</mombt:Gender>
				</mombt:Patient>
				<mombt:Provider Audience="text">
					<mombt:Npi>91171</mombt:Npi>
					<mombt:Role>String</mombt:Role>
					<mombt:IDs Audience="text">
						<mombt:CodeValue>??22393??</mombt:CodeValue>
						<mombt:CodeDescription>Provider</mombt:CodeDescription>
						<mombt:CodeType>Id</mombt:CodeType>
						<mombt:CodingSystem>Intuit</mombt:CodingSystem>
						<mombt:Extended>
							<mombt:AlternativeCodeValue>String</mombt:AlternativeCodeValue>
							<mombt:AlternativeCodeDescription>String</mombt:AlternativeCodeDescription>
							<mombt:AlternativeCodeType>String</mombt:AlternativeCodeType>
							<mombt:AlternativeCodingSystem>String</mombt:AlternativeCodingSystem>
							<mombt:AssigningAuthority>
								<mombt:NamespaceID>String</mombt:NamespaceID>
								<mombt:UniversalID>String</mombt:UniversalID>
								<mombt:UniversalIDType>String</mombt:UniversalIDType>
							</mombt:AssigningAuthority>
							<mombt:CheckDigit>
								<mombt:CheckDigitType>M11</mombt:CheckDigitType>
								<mombt:CheckDigitValue>String</mombt:CheckDigitValue>
							</mombt:CheckDigit>
							<mombt:AssigningFacility>
								<mombt:NamespaceID>String</mombt:NamespaceID>
								<mombt:UniversalID>String</mombt:UniversalID>
								<mombt:UniversalIDType>String</mombt:UniversalIDType>
							</mombt:AssigningFacility>
						</mombt:Extended>
					</mombt:IDs>
					<mombt:Name Audience="text">
						<mombt:Title>String</mombt:Title>
						<mombt:First>String</mombt:First>
						<mombt:Middle>String</mombt:Middle>
						<mombt:Last>String</mombt:Last>
						<mombt:Suffix>String</mombt:Suffix>
						<mombt:NameType>Legal</mombt:NameType>
						<mombt:Degree>String</mombt:Degree>
					</mombt:Name>
					<mombt:Speciality>String</mombt:Speciality>
				</mombt:Provider>
			</PatientMsgBase>
			<SenderPhone Audience="text">
				<mombt:Type>3</mombt:Type>
				<mombt:Description>normalizedString</mombt:Description>
				<mombt:SimplePhoneNumber>normalizedString</mombt:SimplePhoneNumber>
				<mombt:TelecommunicationUse>WorkNumber</mombt:TelecommunicationUse>
				<mombt:TelecommunicationEquipmentType>Telephone</mombt:TelecommunicationEquipmentType>
			</SenderPhone>
			<TreatmentLocation Audience="text">
				<mombt:Code>String</mombt:Code>
				<mombt:Name>String</mombt:Name>
				<mombt:Type>String</mombt:Type>
				<mombt:Address Audience="text">
					<mombt:StructuredAddress Audience="text">
						<mombt:StreetAddress1>normalizedString</mombt:StreetAddress1>
						<mombt:StreetAddress2>normalizedString</mombt:StreetAddress2>
						<mombt:City>normalizedString</mombt:City>
						<mombt:StateOrProvince>normalizedString</mombt:StateOrProvince>
						<mombt:PostalCode>normalizedString</mombt:PostalCode>
						<mombt:Country>US</mombt:Country>
						<mombt:AddressType>Permanent</mombt:AddressType>
						<mombt:CountyCode>String</mombt:CountyCode>
					</mombt:StructuredAddress>
				</mombt:Address>
				<mombt:Contact>String</mombt:Contact>
				<mombt:Phones Audience="text">
					<mombt:Type>3</mombt:Type>
					<mombt:Description>normalizedString</mombt:Description>
					<mombt:SimplePhoneNumber>normalizedString</mombt:SimplePhoneNumber>
					<mombt:TelecommunicationUse>OtherResidenceNumber</mombt:TelecommunicationUse>
					<mombt:TelecommunicationEquipmentType>Fax</mombt:TelecommunicationEquipmentType>
				</mombt:Phones>
			</TreatmentLocation>
			<Attachments></Attachments>
		</GeneralMessage>
	</MessageContent>
</AllscriptsMessageEnvelope>
	</S:Body>
</S:Envelope>

